Revit 2025 API
Zone.CalculatedCoolingLoad Property
Get the Calculated Cooling Load of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double CalculatedCoolingLoad { get; }
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
public:
property double CalculatedCoolingLoad {
	double get ();
}
member CalculatedCoolingLoad : float with get
Property Value
Double
Remarks
This property is used to get the Calculated Cooling Load of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace